NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_wificore_peripherals.h
#define MVDMA_PRESENT 1
#define MVDMA_COUNT 1

#define MVDMA_COMPLETED_EVENT 1                      /*!< EVENTS_COMPLETED is available.                                       */
#define MVDMA_DPPI_DISCONNECTED 0                    /*!< (unspecified)                                                        */
#define MVDMA_INSTANCE_IN_WRAPPER 0                  /*!< (unspecified)                                                        */
#define MVDMA_MVDMA_JOBLISTCNT_MIN 0                 /*!< Number of MVDMA job lists : 0..7                                     */
#define MVDMA_MVDMA_JOBLISTCNT_MAX 7                 /*!< Number of MVDMA job lists : 0..7                                     */
#define MVDMA_MVDMA_JOBLISTCNT_SIZE 8                /*!< Number of MVDMA job lists : 0..7                                     */

/*LRCCONF*/
#define LRCCONF_PRESENT 1
#define LRCCONF_COUNT 1

#define LRCCONF_LRC0_POWERON 1                       /*!< Supports POWERON register                                            */
#define LRCCONF_LRC0_RETAIN 1                        /*!< Supports RETAIN register                                             */
#define LRCCONF_LRC0_SYSTEMOFF 1                     /*!< Supports SYSTEMOFF tasks                                             */
#define LRCCONF_LRC0_LRCREQHFXO 0                    /*!< Does not support REQHFXO and STOPREQHFXO tasks and HFXOSTARTED event */
#define LRCCONF_LRC0_NCLK_MIN 0                      /*!< (unspecified)                                                        */
#define LRCCONF_LRC0_NCLK_MAX 7                      /*!< (unspecified)                                                        */
#define LRCCONF_LRC0_NCLK_SIZE 8                     /*!< (unspecified)                                                        */
#define LRCCONF_LRC0_CLKCTRL 0                       /*!< Does not support clock control and status registers                  */
#define LRCCONF_LRC0_NACTPD_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF_LRC0_NACTPD_MAX 0                    /*!< (unspecified)                                                        */
#define LRCCONF_LRC0_NACTPD_SIZE 1                   /*!< (unspecified)                                                        */
#define LRCCONF_LRC0_PDACT 1                         /*!< Number of active power domains : 0..0                                */
#define LRCCONF_LRC0_NPD_MIN 0                       /*!< (unspecified)                                                        */
#define LRCCONF_LRC0_NPD_MAX 7                       /*!< (unspecified)                                                        */
#define LRCCONF_LRC0_NPD_SIZE 8                      /*!< (unspecified)                                                        */
#define LRCCONF_LRC0_OTHERON 0                       /*!< (unspecified)                                                        */
#define LRCCONF_LRC0_NDOMAINS_MIN 0                  /*!< (unspecified)                                                        */
#define LRCCONF_LRC0_NDOMAINS_MAX 15                 /*!< (unspecified)                                                        */
#define LRCCONF_LRC0_NDOMAINS_SIZE 16                /*!< (unspecified)                                                        */
#define LRCCONF_LRC0_AX2XWAITSTATES 0                /*!< Does not support AX2XWAITSTATES register                             */
#define LRCCONF_LRC0_POWERON_MAIN_RESET 0            /*!< Reset value of register POWERON.MAIN: 0                              */
#define LRCCONF_LRC0_POWERON_ACT_RESET 0             /*!< Reset value of register POWERON.ACT: 0                               */
#define LRCCONF_LRC0_RETAIN_MAIN_RESET 1             /*!< Reset value of register RETAIN.MAIN: 1                               */
#define LRCCONF_LRC0_RETAIN_ACT_RESET 1              /*!< Reset value of register RETAIN.ACT: 1                                */

/*PCGC Master*/
#define PCGCMASTER_PRESENT 1
#define PCGCMASTER_COUNT 1

#define PCGCM_LRC0_POWERCONSUMPTIONCALC 1            /*!< SETPOWERCONSUMPTIONBASE included.                                    */
#define PCGCM_LRC0_SETPWRCONTHRESHOLDBASE 1          /*!< (unspecified)                                                        */
#define PCGCM_LRC0_CLOCKFORCEREG 1                   /*!< (unspecified)                                                        */
#define PCGCM_LRC0_MASTERFORCEREG 1                  /*!< (unspecified)                                                        */

/*Antenna switch controller*/
#define ANTSWC_PRESENT 1
#define ANTSWC_COUNT 1

#define ANTSWC_NRADIOS 2                             /*!< Number of radio ports : 2                                            */
#define ANTSWC_NANTSWBITS 1                          /*!< Number of antenna switch control bits: 1                             */
#define ANTSWC_DPPI_ENABLE_REGISTERS 0               /*!< DPPI registers not available.                                        */

/*BELLBOARD APB registers*/
#define BELLBOARD_PRESENT 1
#define BELLBOARD_COUNT 1

#define BELLBOARD_IRQ_COUNT 4

/*Wi-Fi Information Configuration Registers*/
#define WICR_PRESENT 1
#define WICR_COUNT 1

/*Factory Information Configuration Registers*/
#define FICR_PRESENT 1
#define FICR_COUNT 1

/*User Information Configuration Registers*/
#define UICR_PRESENT 1
#define UICR_COUNT 1

#define UICR_MRAM 1                                  /*!< Descriptions refer to MRAM.                                          */

/*Factory Information Configuration Registers*/
#define SICR_PRESENT 1
#define SICR_COUNT 1

/*CRACENCORE*/
#define CRACENCORE_PRESENT 1
#define CRACENCORE_COUNT 1

#define CRACENCORE_CRYPTMSTRDMAREGS 1                /*!< CRYPTMSTRDMA registers included                                      */
#define CRACENCORE_CRYPTMSTRHWREGS 1                 /*!< CRYPTMSTRHW registers included                                       */
#define CRACENCORE_RNGCONTROLREGS 1                  /*!< RNGCONTROL registers included                                        */
#define CRACENCORE_PKREGS 1                          /*!< PK registers included                                                */
#define CRACENCORE_IKGREGS 1                         /*!< IKG registers included                                               */
#define CRACENCORE_RNGDATAREGS 1                     /*!< RNGDATA registers included                                           */
#define CRACENCORE_EXTPRIVKEYSREGS 0                 /*!< (unspecified)                                                        */
#define CRACENCORE_LITESMALLRESETVALUES 0            /*!< (unspecified)                                                        */
#define CRACENCORE_LITEMEDIUMRESETVALUES 1           /*!< Apply reset values for registers in Lite Medium configuration        */
#define CRACENCORE_FULLRESETVALUES 0                 /*!< (unspecified)                                                        */
#define CRACENCORE_CRACENRESETVALUES 1               /*!< Using CRACENCORE configuration reset values                          */
#define CRACENCORE_SHA3RESETVALUES 0                 /*!< (unspecified)                                                        */
#define CRACENCORE_PKE_DATA_MEMORY 0x50018000        /*!< (unspecified)                                                        */
#define CRACENCORE_PKE_DATA_MEMORY_SIZE 12288        /*!< (unspecified)                                                        */
#define CRACENCORE_PKE_CODE_MEMORY 0x5001C000        /*!< (unspecified)                                                        */
#define CRACENCORE_PKE_CODE_MEMORY_SIZE 8192         /*!< (unspecified)                                                        */

